Public Attributes | List of all members
API_AnalyticalPointLoadGeometry Struct Reference
Analytical Model
Describes a Structural Analytical Model Analytical Point Load Geometry. More...
#include <APIdefs_AnalyticalElements.h>
 Public Attributes
 API_Coord3D  | coordinate
Position of the Analytical Point Load.
Detailed Description
Describes a Structural Analytical Model Analytical Point Load Geometry.
Since
Archicad 25